{
  "nodes": [
    {
      "id": "Development commodified housing",
      "type": "factor"
    },
    {
      "id": "Housing became unaffordable and forced people out",
      "type": "factor"
    },
    {
      "id": "Riots in Oakland in 1967",
      "type": "factor"
    },
    {
      "id": "Family moved back to San Francisco",
      "type": "factor"
    },
    {
      "id": "Green and Kaufman didn't sell to black people",
      "type": "factor"
    },
    {
      "id": "Parents faced challenges in finding housing in San Francisco",
      "type": "factor"
    },
    {
      "id": "Policies that don't provide for affordability",
      "type": "factor"
    },
    {
      "id": "Housing is not affordable",
      "type": "factor"
    },
    {
      "id": "Developers eliminated lower Pacific Heights",
      "type": "factor"
    },
    {
      "id": "Prices increased and community was scattered",
      "type": "factor"
    },
    {
      "id": "Commodification of public spaces",
      "type": "factor"
    },
    {
      "id": "Increased costs and reduced accessibility",
      "type": "factor"
    },
    {
      "id": "Development of downtown",
      "type": "factor"
    },
    {
      "id": "Loss of affordable housing and community spaces",
      "type": "factor"
    },
    {
      "id": "Policies favoring investors over working people",
      "type": "factor"
    },
    {
      "id": "Housing seen as investment, not homes",
      "type": "factor"
    },
    {
      "id": "Support more housing development",
      "type": "stance"
    },
    {
      "id": "Preserve neighborhood character",
      "type": "stance"
    },
    {
      "id": "Prioritize affordable housing",
      "type": "stance"
    },
    {
      "id": "Support housing for essential workers",
      "type": "stance"
    }
  ],
  "edges": [
    {
      "source": "Development commodified housing",
      "target": "Housing became unaffordable and forced people out",
      "explanation": "The commodification of housing refers to treating housing primarily as a financial asset rather than a basic need, which leads to increased prices and displacement of residents.",
      "confidence": "high",
      "source_qa": "What impact did development have on San Francisco's housing market?",
      "stance_implications": "This relationship suggests that housing policies should focus on maintaining housing as a basic need rather than a commodity, potentially advocating for regulations that limit speculative investments in housing."
    },
    {
      "source": "Development commodified housing",
      "target": "Prioritize affordable housing",
      "connection_type": "supports",
      "explanation": "Commodification of housing leads to unaffordability, suggesting a need for policies that prioritize housing as a basic need and ensure affordability."
    },
    {
      "source": "Riots in Oakland in 1967",
      "target": "Family moved back to San Francisco",
      "explanation": "The unrest and riots in Oakland created an unsafe environment, prompting the family to relocate to a more stable area.",
      "confidence": "high",
      "source_qa": "Why did your family move back to San Francisco from Oakland in 1967?",
      "stance_implications": "This highlights the importance of community stability and safety in housing decisions, suggesting policies that promote social cohesion and safety in neighborhoods."
    },
    {
      "source": "Riots in Oakland in 1967",
      "target": "Preserve neighborhood character",
      "connection_type": "supports",
      "explanation": "The need for community stability and safety highlighted by the riots suggests policies that preserve neighborhood character and promote social cohesion."
    },
    {
      "source": "Green and Kaufman didn't sell to black people",
      "target": "Parents faced challenges in finding housing in San Francisco",
      "explanation": "Discriminatory practices by real estate companies limited housing options for black families, creating barriers to homeownership.",
      "confidence": "high",
      "source_qa": "What challenges did your parents face when looking for housing in San Francisco?",
      "stance_implications": "This underscores the need for anti-discrimination policies in housing to ensure equal access for all racial groups."
    },
    {
      "source": "Green and Kaufman didn't sell to black people",
      "target": "Support housing for essential workers",
      "connection_type": "supports",
      "explanation": "Discriminatory practices highlight the need for inclusive policies that ensure essential workers, often from diverse backgrounds, have access to housing."
    },
    {
      "source": "Policies that don't provide for affordability",
      "target": "Housing is not affordable",
      "explanation": "Existing policies fail to address affordability, leading to high housing costs that are inaccessible to many residents.",
      "confidence": "high",
      "source_qa": "What is Angelo Wilson's perspective on the affordability of housing?",
      "stance_implications": "This suggests a need for policy reform to prioritize affordable housing development and ensure that housing remains accessible to all income levels."
    },
    {
      "source": "Policies that don't provide for affordability",
      "target": "Prioritize affordable housing",
      "connection_type": "supports",
      "explanation": "The lack of affordability due to inadequate policies suggests a need to prioritize affordable housing development."
    },
    {
      "source": "Developers eliminated lower Pacific Heights",
      "target": "Prices increased and community was scattered",
      "explanation": "The removal of a predominantly black area by developers led to increased property values and displacement of the existing community.",
      "confidence": "high",
      "source_qa": "How did the development and city planning affect lower Pacific Heights and the Fillmore district?",
      "stance_implications": "This indicates the need for development policies that protect existing communities and prevent displacement due to gentrification."
    },
    {
      "source": "Developers eliminated lower Pacific Heights",
      "target": "Preserve neighborhood character",
      "connection_type": "supports",
      "explanation": "The displacement of communities due to development suggests the need for policies that preserve existing neighborhood character and prevent gentrification."
    },
    {
      "source": "Commodification of public spaces",
      "target": "Increased costs and reduced accessibility",
      "explanation": "Turning public spaces into profit-driven entities increases costs for access, reducing their availability to the general public.",
      "confidence": "medium",
      "source_qa": "How has the commodification of public spaces affected San Francisco?",
      "stance_implications": "Policies should aim to preserve public spaces as accessible and affordable resources for all residents, rather than profit centers."
    },
    {
      "source": "Commodification of public spaces",
      "target": "Preserve neighborhood character",
      "connection_type": "supports",
      "explanation": "The reduction in accessibility of public spaces due to commodification suggests the need to preserve these spaces as part of neighborhood character."
    },
    {
      "source": "Development of downtown",
      "target": "Loss of affordable housing and community spaces",
      "explanation": "The focus on developing office spaces downtown led to the removal of affordable housing options and community spaces like flop houses.",
      "confidence": "medium",
      "source_qa": "What is Angelo Wilson's opinion on the development of downtown San Francisco?",
      "stance_implications": "This suggests a need for balanced development that includes affordable housing and community spaces, not just commercial interests."
    },
    {
      "source": "Development of downtown",
      "target": "Prioritize affordable housing",
      "connection_type": "supports",
      "explanation": "The loss of affordable housing due to downtown development suggests a need for balanced policies that include affordable housing options."
    },
    {
      "source": "Policies favoring investors over working people",
      "target": "Housing seen as investment, not homes",
      "explanation": "Policies that cater to investors encourage viewing housing as a financial asset, leading to prioritization of profit over providing homes.",
      "confidence": "high",
      "source_qa": "What are your views on current housing policies in San Francisco?",
      "stance_implications": "This relationship supports the argument for policies that prioritize housing as a basic need and focus on providing homes for working people."
    },
    {
      "source": "Policies favoring investors over working people",
      "target": "Support housing for essential workers",
      "connection_type": "supports",
      "explanation": "Policies that prioritize investors over working people suggest a need to focus on providing housing for essential workers and treating housing as a basic need."
    }
  ]
}