{
  "nodes": [
    {
      "id": "Homeless youth outside the shop",
      "type": "factor"
    },
    {
      "id": "Tour buses stopped coming",
      "type": "factor"
    },
    {
      "id": "Housing employees",
      "type": "factor"
    },
    {
      "id": "Business increased by 120%",
      "type": "factor"
    },
    {
      "id": "Housing crisis",
      "type": "factor"
    },
    {
      "id": "Long-term residents forced to leave",
      "type": "factor"
    },
    {
      "id": "Artisans forced out of the city",
      "type": "factor"
    },
    {
      "id": "Economic crash in 2008",
      "type": "factor"
    },
    {
      "id": "Sunshine lived in her parents' basement",
      "type": "factor"
    },
    {
      "id": "Pandemic",
      "type": "factor"
    },
    {
      "id": "Business closed for about a year",
      "type": "factor"
    },
    {
      "id": "Lack of safe public transportation",
      "type": "factor"
    },
    {
      "id": "Sunshine walked from Haight Ashbury to the Tenderloin",
      "type": "factor"
    },
    {
      "id": "Non-profit donor funding",
      "type": "factor"
    },
    {
      "id": "Sunshine acquired her shop",
      "type": "factor"
    },
    {
      "id": "Community shift in the Haight",
      "type": "factor"
    },
    {
      "id": "Affordable housing income restrictions",
      "type": "factor"
    },
    {
      "id": "People remain in low-income brackets",
      "type": "factor"
    },
    {
      "id": "Support more housing development",
      "type": "stance"
    },
    {
      "id": "Preserve neighborhood character",
      "type": "stance"
    },
    {
      "id": "Prioritize affordable housing",
      "type": "stance"
    },
    {
      "id": "Support housing for essential workers",
      "type": "stance"
    }
  ],
  "edges": [
    {
      "source": "Homeless youth outside the shop",
      "target": "Tour buses stopped coming",
      "explanation": "The presence of homeless youth outside the shop created a negative perception, leading tour buses to avoid stopping there, which impacted business.",
      "confidence": "high",
      "source_qa": "What challenges did Sunshine Powers face with homeless youth outside her shop?",
      "stance_implications": "This relationship suggests that addressing homelessness could improve business conditions, supporting policies that provide housing solutions for homeless youth."
    },
    {
      "source": "Homeless youth outside the shop",
      "target": "Support more housing development",
      "connection_type": "supports",
      "explanation": "Addressing homelessness through housing development could improve business conditions by reducing negative perceptions and increasing tourism."
    },
    {
      "source": "Housing employees",
      "target": "Business increased by 120%",
      "explanation": "Providing housing for employees likely improved their stability and productivity, contributing to a significant increase in business performance.",
      "confidence": "high",
      "source_qa": "How has housing employees impacted Sunshine Powers' business?",
      "stance_implications": "This supports policies that encourage housing provisions for employees, as it can lead to economic benefits for businesses."
    },
    {
      "source": "Housing employees",
      "target": "Support housing for essential workers",
      "connection_type": "supports",
      "explanation": "Providing housing for employees can lead to increased business performance, highlighting the economic benefits of housing essential workers."
    },
    {
      "source": "Housing crisis",
      "target": "Long-term residents forced to leave",
      "explanation": "The housing crisis, characterized by rising rents, has made it unaffordable for long-term residents to stay, leading to their displacement.",
      "confidence": "high",
      "source_qa": "How has the housing crisis affected the community in the Haight area?",
      "stance_implications": "This highlights the need for affordable housing policies to prevent displacement and maintain community stability."
    },
    {
      "source": "Housing crisis",
      "target": "Artisans forced out of the city",
      "explanation": "The high cost of living due to the housing crisis has made it unsustainable for artisans to remain in the city, forcing them to leave.",
      "confidence": "high",
      "source_qa": "How has the housing crisis impacted artists in the city?",
      "stance_implications": "This suggests the importance of affordable housing to retain cultural and artistic communities in urban areas."
    },
    {
      "source": "Housing crisis",
      "target": "Community shift in the Haight",
      "explanation": "The housing crisis has led to changes in the community composition, affecting the social fabric and cohesion of the Haight.",
      "confidence": "high",
      "source_qa": "How has the housing crisis affected the community in the Haight area?",
      "stance_implications": "This emphasizes the importance of policies that preserve community integrity and prevent displacement due to housing costs."
    },
    {
      "source": "Housing crisis",
      "target": "Prioritize affordable housing",
      "connection_type": "supports",
      "explanation": "The exodus of artisans due to high living costs highlights the need for affordable housing to retain cultural and artistic communities."
    },
    {
      "source": "Housing crisis",
      "target": "Preserve neighborhood character",
      "connection_type": "supports",
      "explanation": "The community shift in the Haight due to the housing crisis emphasizes the importance of preserving neighborhood character by preventing displacement."
    },
    {
      "source": "Economic crash in 2008",
      "target": "Sunshine lived in her parents' basement",
      "explanation": "The economic crash led to financial instability, forcing Sunshine to move back to her parents' home for affordable living.",
      "confidence": "medium",
      "source_qa": "What is Sunshine Powers' personal housing story in San Francisco?",
      "stance_implications": "This underscores the need for economic safety nets and affordable housing options during economic downturns."
    },
    {
      "source": "Economic crash in 2008",
      "target": "Prioritize affordable housing",
      "connection_type": "supports",
      "explanation": "The financial instability caused by the economic crash highlights the need for affordable housing options during economic downturns."
    },
    {
      "source": "Pandemic",
      "target": "Business closed for about a year",
      "explanation": "The pandemic led to health and safety concerns, necessitating the closure of businesses to prevent the spread of the virus.",
      "confidence": "high",
      "source_qa": "What impact did the pandemic have on Sunshine Powers' business?",
      "stance_implications": "This highlights the need for policies that support businesses during public health crises, including financial aid and resources for adaptation."
    },
    {
      "source": "Lack of safe public transportation",
      "target": "Sunshine walked from Haight Ashbury to the Tenderloin",
      "explanation": "Feeling unsafe on public transportation, Sunshine chose to walk long distances to ensure her safety.",
      "confidence": "medium",
      "source_qa": "What challenges did Sunshine Powers face with housing as a woman in San Francisco?",
      "stance_implications": "This suggests the need for improved safety measures on public transportation to ensure accessibility for all, especially women."
    },
    {
      "source": "Non-profit donor funding",
      "target": "Sunshine acquired her shop",
      "explanation": "Funding from a donor allowed Sunshine to purchase her shop, enabling her to reinvest in the community.",
      "confidence": "high",
      "source_qa": "How did Sunshine Powers acquire her shop?",
      "stance_implications": "This supports the role of philanthropy and community investment in empowering local businesses and community development."
    },
    {
      "source": "Affordable housing income restrictions",
      "target": "People remain in low-income brackets",
      "explanation": "Income restrictions for affordable housing discourage individuals from increasing their income, as it may lead to loss of housing eligibility.",
      "confidence": "high",
      "source_qa": "What is your stance on the current affordable housing policies?",
      "stance_implications": "This suggests revising affordable housing policies to allow for income growth without penalizing residents, promoting economic mobility."
    },
    {
      "source": "Affordable housing income restrictions",
      "target": "Prioritize affordable housing",
      "connection_type": "supports",
      "explanation": "Revising income restrictions in affordable housing policies can promote economic mobility and prevent residents from being trapped in low-income brackets."
    }
  ]
}